app/controllers/photos_controller.rb

INSERT INTO "photos" ("created_at", "description", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @photo = Photo.new(params[:photo])
    @photo.image = File.new(upload_path)
    @photo.save